Repository: michalfita/mgr_thesis
Catalog: workspace/Robotiq/pot/*.po
Languages: pl

source: _Serial Communication
pl: Komunikacja _szeregowa

source: Use serial communication to interact with robot.
pl: Użyj komunikacji szeregowej do interakcji z robotem.

source: Serial Port
pl: Port szeregowy

source: Baud Rate
pl: Prędkość danych

source: Number of data bits
pl: Ilość bitów danych

source: Parity check mode
pl: Tryb sprawdzania parzystości

source: Stop bits
pl: Bity stopu

source: XON/XOFF flow control
pl: Kontrola przepływu XON/XOFF

source: RTS/CTS flow control
pl: Kontrola przepływu RTS/CTS

source: Press Control Up
pl: Naciśnięcie w górę

source: Release Control Up
pl: Zwolnienie w dół

source: Press Control Down
pl: Naciśniecie w dół

source: Release Control Down
pl: Zwolnienie w dół

source: Press Control Left
pl: Naciśnięcie w lewo

source: Press Control Right
pl: Naciśnięcie w prawo

source: Release Control Right
pl: Zwolnienie w prawo

source: Press Control Stop
pl: Naciśnięcie stop

source: Release Control Stop
pl: Zwolnienie stop

source: Press Control Right Arm Up
pl: Naciśnięcie prawe ramię w góre

source: Release Control Right Arm Up
pl: Zwolnienie prawe ramię w górę

source: Press Control Right Arm Down
pl: Naciśnięcie prawe ramie w dół

source: Release Control Right Arm Down
pl: Zwolnienie prawe ramię w dół

source: Press Control Right Arm In
pl: Naciśnięcie prawe ramię do wewnątrz

source: Release Control Right Arm In
pl: Zwolnienie prawe ramię do wewnątrz

source: Press Control Right Arm Out
pl: Naciśnięcie prawe ramię na zewnątrz

source: Release Control Right Arm Out
pl: Zwolnienie prawe ramię do zewnątrz

source: Press Control Tilt Right
pl: Naciśnięcie przechył w prawo

source: Release Control Tilt Right
pl: Zwolnienie przechył w prawo

source: Press Control Left Arm Up
pl: Naciśnięcie lewe ramię w górę

source: Release Control Left Arm Up
pl: Zwolnienie lewe ramię w dół

source: Press Control Left Arm Down
pl: Naciśnięcie lewe ramię w dół

source: Release Control Left Arm Down
pl: Naciśnięcie lewe ramię w dół

source: Press Control Left Arm In
pl: Naciśnięcie lewe ramię do wewnątrz

source: Release Control Left Arm In
pl: Zwolnienie lewe ramię do wewnątrz

source: Press Control Left Arm Out
pl: Naciśnięcie lewe ramię na zewnątrz

source: Release Control Left Arm Out
pl: Zwolnienie lewe ramię na zewnątrz

source: Press Control Tilt Left
pl: Naciśnięcie przechył w lewo

source: File: %s, Line: %d, In function: <b>%s</b> Cause: %s
pl: Plik: %s, Linia: %d, W funkcji: <b>%s</b> Powód: %s

source: Unhandled exception
pl: Nieuchwycony wyjątek

source: The <b>error</b> "%s: %s" that has just occured during program operation left following <b>traceback</b>:
pl: <b>Błąd</b> "%s: %s" który właśnie nastąpił w czasie działania programu, pozostawił następujący <b>ślad</b>:

source: Release %d
pl: wydanie %d

source: Copyright by Micha305202 Fita 302251 2008-2009. Some rights reserved according to the license.
pl: Copyright Michał Fita © 2008-2009. Wszelkie prawa zastrzeżone według z licencji.

source: This is the application for control the robot mechanics by processor board processing the commands.
pl: To jest aplikacja do kontroli mechaniki robota poprzez płytę procesora przetwarzającą komendy.

source: Author of the icon: %s
pl: Autor ikony: %s

source: translator-credits
pl: Michał Fita <michal.fita@gmail.com>

source: New action has to have name string, other types are not allowed.
pl: Nowa akcja musi posiadać nazwę w postaci ciągu, inne typy nie są dopuszczalne.

source: New action has to have callable object as second argument.
pl: Nowa akcja musi posiadać wywoływalny obiekt jako drugi argument.

source: No such action as "%s" found.
pl: Akcji takiej jak "%s" nie znaleziono.

source: You failed, sucker! You cannot dispatch item, only add to and remove from action.
pl: Porażka, frajerze! Nie możesz przesyłać elementu, tylko dodawać do i usuwać z akcji.

source: Configure commands bound to buttons.
pl: Konfiguracja komend powiązanych z przyciskami.

source: _Settings
pl: U_stawienia

source: Arms
pl: Ramiona

source: Hips
pl: Biodra

source: Legs
pl: Nogi

source: Commands configuration
pl: Konfiguracja komend

source: Connect to the robot.
pl: Połącz z robotem.

source: _Connect
pl: Połą_cz

source: Disconnect the connection.
pl: Rozłącz połączenie.

source: _Disconnect
pl: Ro_złącz

source: Confi_guration
pl: Konfi_guracja

source: Configure all communication channels.
pl: Skonfiguruj wszystkie kanały komunikacyjne.

source: Connection configuration
pl: Konfiguracja połączenia

source: Disable
pl: Wyłącz

source: Enable
pl: Włącz

source: Parameter
pl: Parametr

source: Value
pl: Wartość

source: Command "%s" not implemented in drawing.
pl: Komenda "%s" nie zaimplementowana w rysowaniu.

source: _File
pl: _Plik

source: _Edit
pl: _Edycja

source: Placeholder
pl: Zaklepane miejsce

source: _Connection
pl: Połą_czenie

source: Co_mmands
pl: Ko_mendy

source: _Help
pl: P_omoc

source: Cu_t
pl: Wy_tnij

source: Put selected content into the clipboard and remove from context.
pl: Umieść zaznaczoną teść w schowku i usuń ją z kontekstu.

source: Copy seleted content into the clipboard.
pl: Skopiuj zaznaczoną treść do schowka.

source: _Copy
pl: _Kopiuj

source: Paste the content of clipboard in active context.
pl: Wklej zawartość schowka w aktywnym kontekście.

source: _Paste
pl: _Wklej

source: Select _All
pl: Z_aznacz wszystko

source: Select all in active context.
pl: Zaznacz wszystko w aktyewym kontekście.

source: Displays information about application and its license.
pl: Wyświetla informacje o aplikacji i jej licencji.

source: _About
pl: _O programie

source: Leave the application.
pl: Opuść aplikację.

source: _Quit
pl: _Wyjście
